const app = getApp();
Page({
  data: {
    logData: [{
      version: "v1.4.9",
      data: "2023/11/18",
      info: ["1.光萌词汇中心兼容QQ群"]
    }, {
      version: "v1.4.8",
      data: "2023/11/12",
      info: ["1.增加 看视频激励广告续期频道"]
    }, {
      version: "v1.4.7",
      data: "2023/11/4",
      info: ["1.修正部分文案描述"]
    }, {
      version: "v1.4.6",
      data: "2023/11/3",
      info: ["1.更新值班室设置页"]
    }, {
      version: "v1.4.5",
      data: "2023/10/25",
      info: ["1.完善细节和频道管理"]
    }, {
      version: "v1.4.4",
      data: "2023/10/21",
      info: ["1.修复自动奖励设置"]
    }, {
      version: "v1.4.3",
      data: "2023/10/19",
      info: ["1.开放部分积分奖励设置页"]
    }, {
      version: "v1.4.2",
      data: "2023/10/18",
      info: ["1.部分页面优化"]
    }, {
      version: "v1.4.1",
      data: "2023/10/14",
      info: ["1.修复新人加入设置", "2.开放赞助设置"]
    }, {
      version: "v1.4.0",
      data: "2023/10/13",
      info: ["1.增加银行固定资产排行"]
    }, {
      version: "v1.3.9",
      data: "2023/10/12",
      info: ["1.修复显示问题"]
    }, {
      version: "v1.3.8",
      data: "2023/10/9",
      info: ["1.增加资产银行", "2.增加新指令"]
    }, {
      version: "v1.3.7",
      data: "2023/10/7",
      info: ["1.优化资产排行、打卡排行"]
    }, {
      version: "v1.3.6",
      data: "2023/10/6",
      info: ["1.个人中心增加退出小程序按钮", "2.等级发言限制支持频道白名单", "3.其他优化"]
    }, {
      version: "v1.3.5",
      data: "2023/9/28",
      info: ["1.页面优化", "2.增加打卡排行、资产排行", "3.更多的新人加入设置", "4.转账、转换手续费显示", "5.其他更多优化"]
    }, {
      version: "v1.3.4",
      data: "2023/9/27",
      info: ["1.修复礼品图片显示问题"]
    }, {
      version: "v1.3.3",
      data: "2023/9/27",
      info: ["1.开放礼品商店等"]
    }, {
      version: "v1.3.2",
      data: "2023/9/18",
      info: ["1.登录模式更新", "2.开放部分积分页面"]
    }, {
      version: "v1.3.1",
      data: "2023/9/17",
      info: ["1.紫管主题也会转发", "2.定时任务改为markdown", "3.敏感词提醒改为markdown", "4.值班室更新", "5.增加敏感词库"]
    }, {
      version: "v1.3.0",
      data: "2023/9/5",
      info: ["1.部分默认数据修改", "2.开放值班系统", "3.增加值班任务列表", "4.增加解禁申诉页", "5.敏感词支持设置排除的身份组"]
    }, {
      version: "v1.2.9",
      data: "2023/8/25",
      info: ["1.textarea部分问题修复", "2.图片显示问题修复", "3.敏感词增加提示文本设置", "4.新人加入设置增加自动解禁", "5.页面长昵称显示优化", "6.系统日志页增加操作"]
    }, {
      version: "v1.2.8",
      data: "2023/8/21",
      info: ["1.修复入频验证码计算式显示", "2.更新部分指令说明", "3.成员通知支持md语法"]
    }, {
      version: "v1.2.7",
      data: "2023/8/17",
      info: ["1.修复普通成员显示问题"]
    }, {
      version: "v1.2.6",
      data: "2023/8/10",
      info: ["1.系统日志页增加用户操作"]
    }, {
      version: "v1.2.5",
      data: "2023/8/9",
      info: ["1.QQ的emoji并入小黄豆表情列表", "2.黑名单列表显示问题修复"]
    }, {
      version: "v1.2.4",
      data: "2023/8/5",
      info: ["1.指令列表增加搜索框", "2.各设置页增加'所有子频道'选项", "3.指令权限分配保存问题维修", "4.新的名片敏感词效果", "5.支持小黄豆表情", "6.支持表情表态限制", "7.新的新人验证模式"]
    }, {
      version: "v1.2.2",
      data: "2023/8/3",
      info: ["淡化文字水印"]
    }, {
      version: "v1.2.1",
      data: "2023/8/2",
      info: ["优化"]
    }, {
      version: "v1.2.0",
      data: "2023/7/30",
      info: ["优化"]
    }, {
      version: "v1.1.9",
      data: "2023/7/28",
      info: ["优化"]
    }, {
      version: "v1.1.8",
      data: "2023/7/27",
      info: ["优化"]
    }, {
      version: "v1.1.7",
      data: "2023/7/26",
      info: ["优化(省略1000字)"]
    }, {
      version: "v1.1.6",
      data: "2023/7/21",
      info: ["1.增加邀请统计"]
    }, {
      version: "v1.1.5",
      data: "2023/7/20",
      info: ["1.多身份组ui优化"]
    }, {
      version: "v1.1.4",
      data: "2023/7/18",
      info: ["1.自助领取身份组修复"]
    }, {
      version: "v1.1.3",
      data: "2023/7/14",
      info: ["1.抬高输入框方便编辑", "2.解决文中不能插入子频道问题", "3.其他变更"]
    }, {
      version: "v1.1.2",
      data: "2023/7/11",
      info: ["1.增加光萌订阅"]
    }, {
      version: "v1.1.1",
      data: "2023/7/10",
      info: ["1.增加页面"]
    }, {
      version: "v1.1.0",
      data: "2023/7/7",
      info: ["1.小程序加入自动更新", "2.日志列表长文本显示优化", "3.其他调整"]
    }, {
      version: "v1.0.9",
      data: "2023/7/6",
      info: ["1.增加批量设置指令权限", "2.增加批量分配后台权限", "3.增加其他身份组后台权限分配", "4.开放定时全员禁言", "5.开放定时消息推送", "6.个人信息页数据展示优化", "7.增加新指令", "8.自助领取身份组设置优化"]
    }, {
      version: "v1.0.8",
      data: "2023/7/2",
      info: ["1.新人加入通知、成员退出通知快捷跳转修复", "2.名片格式锁定功能可指定生效身份组", "3.开放新人加入设置，可设置禁言、赋予身份"]
    }, {
      version: "v1.0.7",
      data: "2023/6/27",
      info: ["1.增加新的验证模式", "2.入退频通知等换成markdown"]
    }]
  }
})